
Script wrangle_data.do in stata-mp started at 2025-07-24 11:16:02
Script wrangle_data.do finished successfully at 2025-07-24 11:16:02
Output:

  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 4-core network, expiring  1 Jul 2026
Serial number: 501909301221
  Licensed to: Marek Chadim
               Yale University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do wrangle_data.do 

. * ===========================================================================
> ==
. * Short description of script's purpose
. * ===========================================================================
> ==
. 
. clear all

. adopath + "../../lib/stata"
  [1]  (BASE)      "/Applications/StataNow/ado/base/"
  [2]  (SITE)      "/Applications/StataNow/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/marek/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/marek/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../../lib/stata"

. set linesize 100

. 
. * =============================================================================
. 
. program main
  1.     insheet using "../input/mpg.csv", comma clear
  2.     clean_data
  3.     save "../output/mpg.dta", replace
  4. end

. 
. program clean_data
  1.     di ""
  2.     * Some data wrangling steps here
. end

. 
. * Execute
. main
(11 vars, 234 obs)

(file ../output/mpg.dta not found)
file ../output/mpg.dta saved

. 
end of do-file

make.sh finished at 2025-07-24 11:16:02
